
// Інкапсуляція - Приховування внутрішньої реалізації від посторонніх, обмеження доступу до даних і можливостям їх зміни.  Дозволяє сховати в собі агрументи для методів і оперувати тільки ними

      // зменшує складність і підвищує перевикористання


// Абстракція означає виділення головних, найбільш значимих характеристик предмета і навпаки - відкидання другорядних, незначних.

    // зменшує складність і ізолює непотрібний вплив



//  Наслідування - механізм який дозволяє описати новий клас на основі вже існуючого (батьківського), при цьому властивості  і функціональність батьківського класу запозичуються новим класом.

    // зменшення надлишкового коду


// Поліморфізм - можливість об'єктів з однаковою специфікацією мати різну реалізацію (можливість перегрузки методів).

    // дозволяє уникати лишніх умов